Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Users often avoid downloading apps that seem too large, particularly in emerging markets where devices connect to often-spotty 2G and 3G networks or work on pay-by-the-byte plans.
zh_cn: 用户经常避免下载看起来太大的应用程序，特别是在新兴市场中，设备连接到不稳定的的 2G 和 3G 网络或者使用按字节付费的套餐。

source: Using 0dp, which is the equivalent of "MATCH_CONSTRAINT"
zh_cn: 使用 0dp，相当于 "MATCH_CONSTRAINT"

source: Using WRAP_CONTENT, which will ask the widget to compute its own size
zh_cn: 使用 WRAP_CONTENT，这将要求小部件计算自己的尺寸

source: Using TextInputEditText instead of an EditText provides accessibility support for the text field and allows TextInputLayout greater control over the visual aspects of the text field.
zh_cn: 使用 TextInputEditText 而不是 EditText 为文本字段提供了可访问性支持，并允许 TextInputLayout 更好地控制文本字段的可视方面。

source: Using Views
zh_cn: 使用 View

source: Using a TextureView is simple: all you need to do is get its SurfaceTexture.
zh_cn: 使用 TextureView 很简单：只需要​​获取 SurfaceTexture 即可。

source: Using a specific dimension (either a literal value such as 123dp or a Dimension reference)
zh_cn: 使用具体的尺寸(一个字面值如 123dp 或者一个 Dimension 引用)。

source: Using application resources makes it easy to update various characteristics of your application without modifying code, and—by providing sets of alternative resources—enables you to optimize your application for a variety of device configurations (such as for different languages and screen sizes).
zh_cn: 使用应用程序资源可以轻松更新应用程序的各种特性而无需修改代码，并且通过提供备用资源集 - 使你能够针对各种设备配置(例如针对不同语言和屏幕大小)优化应用程序。

source: Using bias, you can craft User Interfaces that will better adapt to screen sizes changes.
zh_cn: 使用偏心，你可以制作更好的适应屏幕尺寸更改的用户界面。

source: Using debug symbols makes sense if your application is in development and still requires debugging.
zh_cn: 如果你的应用程序正在开发中并且仍需要调试，则使用调试符号很有意义。

source: Using dp units (instead of px units) is a simple solution to making the view dimensions in your layout resize properly for different screen densities.
zh_cn: 使用 dp 单位(而不是 px 单位)是一种简单的解决方案，可以使布局中的视图尺寸适当调整以适应不同的屏幕密度。

source: Using the name you provide in the <item> element, the Android developer tools create a unique integer in your project's R.java class, which you can use as an identifier for an application resources (for example, a View in your UI layout) or a unique integer for use in your application code (for example, as an ID for a dialog or a result code).
zh_cn: 使用你在 <item> 元素中提供的名称，Android 开发人员工具在项目的 R.java 类中创建一个唯一的整数，你可以将其用作标识符应用程序资源(例如，UI 布局中的 View)或用于应用程序代码的唯一整数(例如，作为对话框的 ID 或结果代码)。

source: Using these graphics can greatly reduce your APK footprint.
zh_cn: 使用这些图形可以大大减少你的 APK 占用空间。

source: Using this class allows us to display a hint in the IME when in 'extract' mode and provides accessibility support for TextInputLayout.
zh_cn: 使用此类允许我们在“extract”模式下在 IME 中显示提示，并为 TextInputLayout 提供辅助功能支持。

source: Using this function takes some care, as it has a fairly complicated interaction with View#onTouchEvent(MotionEvent) View.onTouchEvent(MotionEvent), and using it requires implementing that method as well as this one in the correct way.
zh_cn: 使用此函数需要特别小心，因为它与 View#onTouchEvent(MotionEvent) View.onTouchEvent(MotionEvent) 进行了相当复杂的交互，并且使用它需要正确实现这两个方法。

source: Using this function takes some care, as it has a fairly complicated interaction with View#onTouchEvent(MotionEvent), and using it requires implementing that method as well as this one in the correct way.
zh_cn: 使用此函数需要特别小心，因为它与 View#onTouchEvent(MotionEvent) 进行了相当复杂的交互，并且使用它需要正确实现这两个方法。

source: Usually on the left.
zh_cn: 通常在左边。

source: Usually on the right.
zh_cn: 通常在右边。

source: Utility class representing a Guideline helper object for ConstraintLayout.
zh_cn: 表示 ConstraintLayout 的 Guideline helper 对象的实体类。

source: Valid values are between 0.0f and 1.0f.
zh_cn: 有效值介于 0.0f 和 1.0f 之间。

source: Value is 1 or greater.
zh_cn: 值为 1 或更大。

source: Values for box background mode.
zh_cn: 框背景模式的值。

source: Values for the end icon mode.
zh_cn: 结束图标模式的值。

source: Vector images are represented in Android as VectorDrawable objects.
zh_cn: 矢量图像在 Android 中表示为 VectorDrawable 对象。

source: Vertical Axis: top, bottom sides and text baseline
zh_cn: 垂直轴：top, bottom 边以及文本基线

source: Vertical Guidelines have a width of zero and the height of their ConstraintLayout parent
zh_cn: 水平的 Guidelines 宽度为 0，高度为其父 ConstraintLayout 的高度。

source: View IDs need not be unique throughout the tree, but it is good practice to ensure that they are at least unique within the part of the tree you are searching.
zh_cn: 在整个 view 树上，view 的 id 不一定需要唯一，但至少保证在 view 树中你要搜索的部分保证唯一是好的惯例。

source: View classes can specify a default behavior when used as a child of a CoordinatorLayout using the CoordinatorLayout.DefaultBehavior annotation.
zh_cn: 使用 CoordinatorLayout.DefaultBehavior 注解时，View 类可以在用作 CoordinatorLayout 的子项时指定默认 behavior。

source: View flag indicating that the screen should remain on while the window containing this view is visible to the user.
zh_cn: view 标志，指示当用户可以看到包含此​​view 的窗口时，屏幕应保持打开状态。

source: View flag indicating whether addFocusables(java.util.ArrayList, int, int) should add all focusable Views regardless if they are focusable in touch mode.
zh_cn: view 标志，指示 addFocusables(java.util.ArrayList, int, int) 应添加所有可聚焦 view，无论它们是否可在触摸模式下聚焦。

source: View flag indicating whether addFocusables(java.util.ArrayList, int, int) should add only Views focusable in touch mode.
zh_cn: view 标志，指示 addFocusables(java.util.ArrayList, int, int) 应仅添加可在触摸模式下聚焦的 view。

source: View flag indicating whether this view should have haptic feedback enabled for events such as long presses.
zh_cn: iew 标志，指示此 view 是否应为长按等事件启用触觉反馈。

source: View flag indicating whether this view should have sound effects enabled for events such as clicking and touching.
zh_cn: view 标志，指示此 view 是否应为单击和触摸等事件启用声音效果。

source: View is the base class for widgets, which are used to create interactive UI components (buttons, text fields, etc.).
zh_cn: View 是 widgets 的基类，widgets 用来创建交互 UI 组件(按钮，文本等)。

source: View this page in Kotlin
zh_cn: 在 Kotlin 中查看此页面

source: View to anchor the auto-complete dropdown to.
zh_cn: 锚定自动补全下拉菜单的 View。

source: View | Android Developers
zh_cn: he amount of pixels to scroll by horizontallyView | Android Developers

source: ViewCacheExtension is a helper class to provide an additional layer of view caching that can be controlled by the developer.
zh_cn: ViewCacheExtension 是一个助手类，它提供了一个可以由开发人员控制的 view 缓存的附加层。

source: ViewCacheExtension is a helper class to provide an additional layer of view caching that can ben controlled by the developer.
zh_cn: ViewCacheExtension 是一个助手类，提供一个可被开发者控制的 view 缓存的额外一层。

source: ViewPager integration
zh_cn: ViewPager 集成

source: ViewPager is most often used in conjunction with Fragment, which is a convenient way to supply and manage the lifecycle of each page.
zh_cn: ViewPager 通常与 Fragment 结合使用，这是一种提供和管理每个页面生命周期的便捷方式。

source: ViewPager2 replaces ViewPager, addressing most of its predecessor’s pain-points, including right-to-left layout support, vertical orientation, modifiable Fragment collections, etc.
zh_cn: ViewPager2 取代了 ViewPager，解决了其前任的大部分难点，包括从右到左的布局支持，垂直方向，可修改的 Fragment 集合等。

source: Views are added to cache if and only if they are recyclable, so this method does not check it again.
zh_cn: 只有当 view 可回收使用时，才会将其添加到缓存中，因此此方法不会再次对其进行检查。

source: Views are redrawn very frequently, and many drawing objects require expensive initialization.
zh_cn: view 重新绘制非常频繁，许多绘制对象需要昂贵的初始化。

source: Views given to the Gallery should use Gallery.LayoutParams as their layout parameters type.
zh_cn: 给图库的 view 应使用 Gallery.LayoutParams 作为其布局参数类型。

source: Views indicate their willingness to take focus through the isFocusable() method.
zh_cn: view 通过 isFocusable() 方法指明它们是否想要获取焦点。

source: Views invoking nested scrolling functionality should always do so from the relevant ViewCompat, ViewGroupCompat or ViewParentCompat compatibility shim static methods.
zh_cn: 调用嵌套滚动功能的 view 应始终从相关的 ViewCompat，ViewGroupCompat 或 ViewParentCompat 兼容性静态方法。

source: Views may have an integer id associated with them.
zh_cn: View 可能有一个与之关联的整数 id。

source: Views that are View.GONE are used for sizing only if setConsiderGoneChildrenWhenMeasuring() is set to true.
zh_cn: 仅当 setConsiderGoneChildrenWhenMeasuring() 设置为 true 时，才会使用 View.GONE 的 view 进行大小调整。

source: Views which are annotated with the ViewPager.DecorView annotation are treated as part of the view pagers 'decor'.
zh_cn: 使用 ViewPager.DecorView 注解的 view 将被视为 view pager “装饰”的一部分。

source: Virtual Helper objects
zh_cn: 虚拟助手对象

source: Virtual Helpers objects
zh_cn: 虚拟助手对象

source: Visibility behavior
zh_cn: 可见性行为

source: WRAP_CONTENT, which means that the view wants to be just big enough to enclose its content (plus padding).
zh_cn: WRAP_CONTENT，意味着 view 只想要足够大以容纳它的内容(加上 padding)。

source: Wakes up a single thread that is waiting on this object's monitor.
zh_cn: 唤醒正在等待该对象监视器的单个线程。

source: Wakes up all threads that are waiting on this object's monitor.
zh_cn: 唤醒在该对象监视器上等待的所有线程。

source: Walk up the hierarchy to determine if we're inside a scrolling container.
zh_cn: 遍历层次结构，以确定我们是否在滚动容器中。

source: Warm start
zh_cn: 温启动（Warm start）

source: We are NOT sending the offsetPosition because LayoutManager does not know it.
zh_cn: 我们不发送 offsetPosition，因为 LayoutManager 不知道。

source: We are currently waiting for better attribute support in ColorStateLists to land in the support library.
zh_cn: 我们目前正在等待 ColorStateLists 中更好的属性支持到达支持库。

source: We are looking up the accessibility focused host to avoid keeping state since these events are very rare.
zh_cn: 我们查找以无障碍焦点 host，以避免保持状态，因为这些事件非常罕见。

source: We don't have focus or no virtual descendant has it, do not handle the event.
zh_cn: 我们没有焦点，或者没有虚拟子代有焦点，请不要处理该事件。

source: We don't need this in pre-layout since the VH is not updated by the LM.
zh_cn: 我们在预先布局不需要这样，因为 VH 不是由 LM 更新的。

source: We expect that as IDE users work on the code, imports in all packages will match this pattern without extra engineering effort.
zh_cn: 我们希望 IDE 用户在编写代码时，系统对所有软件包的导入都符合此模式，无需再进行额外的工程处理。

source: We have focus and got the event, then use normal event dispatch.
zh_cn: 我们有焦点，得到事件，然后使用正常的事件分发。

source: We just need to unhide, detach and move to the scrap list.
zh_cn: 我们只需要取消隐藏、分离并移到废料列表。

source: We may do a double iteration but this is safer given the timeframe.
zh_cn: 我们可以做两次迭代，但考虑到时间范围，这样做更安全。

source: We now have our custom component, but how can we use it?
zh_cn: 我们现在有自己的自定义组件了，怎么使用呢？We now have our custom component, but how can we use it?

source: We present global style rules here so people know the vocabulary, but local style is also important.
zh_cn: 我们在此提出整体样式规则，让用户都知道这一词汇表，但局部样式也很重要。

source: We recognize that long methods are sometimes appropriate, so no hard limit is placed on method length.
zh_cn: 我们了解，有些情况下较长的方法是恰当的，因此对方法的代码长度没有做出硬性限制。

source: We recognize that not all existing code follows these rules, but we expect all new code to be compliant.
zh_cn: 我们知道，并非所有的现有代码都遵守了这些规则，但我们希望所有新代码都能遵守这些规则。

source: We recommend that every app include at least an xxhdpi image variant.
zh_cn: 我们建议每个应用至少包含一个 xxhdpi 图像变体。

source: We recommend that you always optimize based on an assumption of a cold start.
zh_cn: 我们建议你始终根据冷启动的假设进行优化。

source: We recommend that, rather than disabling the preview window, you follow the common Material Design patterns.
zh_cn: 我们建议你不要禁用预览窗口，而是遵循常见的 Material Design 模式。

source: We recommend you start with ListAdapter, the higher-level API that builds in List diffing on a background thread, with minimal code.
zh_cn: 我们建议你从 ListAdapter 开始，这是在后台线程上以 List 构建的更高级别的 API，用最少的代码。

source: We recommend, however, that you reuse the same set of resources, customizing them as needed at runtime.
zh_cn: 但是，我们建议你重用同一组资源，并在运行时根据需要自定义它们。

source: We require braces around the statements for a conditional.
zh_cn: 我们需要在条件语句周围添加大括号。

source: We still need to call this method to handle the cases where performClick() was called externally, instead of through performClickInternal()
zh_cn: 我们仍然需要调用此方法来处理外部调用 performClick() 而不是通过 performClickInternal() 调用 performClick() 的情况

source: We use eight (8) space indents for line wraps, including function calls and assignments.
zh_cn: 我们使用八 (8) 个空格来缩进自动换行，包括函数调用和赋值。

source: We use four (4) space indents for blocks and never tabs.
zh_cn: 我们使用四 (4) 个空格来缩进块，而不要使用制表符。

source: We will add a 'dummy view' to the Toolbar which allows us to work out the available space for the title.
zh_cn: 我们将在工具栏中添加一个“虚拟 view”，以便我们计算出标题的可用空间。

source: WebView objects allow you to display web content as part of your activity layout, but lack some of the features of fully-developed browsers.
zh_cn: WebView 对象允许你将 Web 内容显示为 activity 布局的一部分，但缺少完全开发的浏览器的一些功能。

source: Weight on a pane that becomes covered indicates that the pane should be sized to fill all available space except a small minimum strip that the user may use to grab the slideable view and pull it back over into a closed state.
zh_cn: 被覆盖的窗格上的权重表示窗格的大小应该填充所有可用空间，除了用户可以用来抓住可滑动 view 并将其拉回到关闭状态的小的最小条带。

source: Weighted chain -- in CHAIN_SPREAD mode, if some widgets are set to MATCH_CONSTRAINT, they will split the available space
zh_cn: 加权链 -- 在 CHAIN_SPREAD 模式下，如果一些部件设置为 MATCH_CONSTRAINT 它们将拆分可用的空间

source: Weighted chains
zh_cn: 加权链

source: Well-written custom views can also be added and styled via XML.
zh_cn: 编写良好的自定义 view 也可以通过 XML 添加和设置样式。

source: What happens in this case is that the constraints act like opposite forces pulling the widget apart equally (Fig. 4); such that the widget will end up being centered in the parent container.
zh_cn: 在这种情况下发生的是，约束就像是从两边用相反的力拉小部件(图 4)，所以最终使得小部在父容器中居中。

source: When Recycler#getViewForPosition(int) is called, Recycler checks attached scrap and first level cache to find a matching View.
zh_cn: 当调用 Recycler#getViewForPosition(int) 时，Recycler 会检查附加的废料和一级缓存以找到匹配的 view。

source: When inflate() is invoked, the ViewStub is replaced by the inflated View and the inflated View is returned.
zh_cn: 当调用 inflate() 时，ViewStub 将由加载的 View 替换，并返回加载的 View。

source: When a @SuppressWarnings annotation is necessary, it must be prefixed with a TODO comment that explains the "impossible to eliminate" condition.
zh_cn: 当需要 @SuppressWarnings 注释时，必须在前面添加一个 TODO 备注，用于说明 "无法消除" 情况。

source: When a @SuppressWarnings annotation is required, the code should be refactored to isolate the software elements where the annotation applies.
zh_cn: 当需要 @SuppressWarnings 注释时，你应该重构代码以分离出需要使用该注释的软件元素。

source: When a ViewGroup is passed a View whose layout params do not pass the test of checkLayoutParams(android.view.ViewGroup.LayoutParams), this method is invoked.
zh_cn: 当 ViewGroup 传递一个 View，其布局参数不通过 checkLayoutParams(android.view.ViewGroup.LayoutParams) 的测试时，将调用此方法。

source: When a ViewStub is made visible, or when inflate() is invoked, the layout resource is inflated.
zh_cn: 当让 ViewStub 可见时，或者调用 inflate() 时，布局资源会加载。

source: When a condition that would normally justify some logging is likely to occur many times, it can be a good idea to implement some rate-limiting mechanism to prevent overflowing the logs with many duplicate copies of the same (or very similar) information.
zh_cn: 当事实证明某些日志记录可能会发生多次时，最好实施一种频率限制机制来防止出现具有相同(或非常相似)信息的大量重复日志副本。

source: When a linear layout is part of another layout that is baseline aligned, it can specify which of its children to baseline align to (that is, which child TextView).
zh_cn: 当线性布局是基线对齐的另一个布局的一部分时，它可以指定要与哪个子 view 的基线对齐(即，哪个子 TextView)。

source: When a user downloads your app, their device receives the correct APK based on the device's features and settings.
zh_cn: 当用户下载你的应用时，他们的设备会根据设备的功能和设置收到正确的 APK。

source: When a user is navigating a user interface via directional keys such as a D-pad, it is necessary to give focus to actionable items such as buttons so the user can see what will take input.
zh_cn: 当一个用户使用方向型按键，如 D-pad，操作用户界面时，很必要给可控的项目焦点，如按钮，这样用户才能看到哪一个将获取输入。

source: When a view is created from an XML layout, all of the attributes in the XML tag are read from the resource bundle and passed into the view's constructor as an AttributeSet.
zh_cn: 从 XML 布局创建 view 时，XML 标记中的所有属性都从资源包中读取，并作为 AttributeSet 传递到 view 的构造函数中。

source: When a view's measure() method returns, its getMeasuredWidth() and getMeasuredHeight() values must be set, along with those for all of that view's descendants.
zh_cn: 当一个 view 的 measure() 方法返回，它的 getMeasuredWidth() 和 getMeasuredHeight() 值必须要设置，其所有子 view 的值也要设置。

source: When an Xfermode is assigned to an Paint, then objects drawn with that paint have the xfermode applied.
zh_cn: 将 Xfermode 分配给 Paint 时，使用该 Paint 绘制的对象将应用 xfermode。

source: When an animation is started, the framework will take care of redrawing the appropriate views until the animation completes.
zh_cn: 当开始一个动画时，框架负责绘制合适的 view 直到动画完成。

source: When building the release version of your app, package uncompressed .so files in the APK by setting android:extractNativeLibs="false" in the <application> element of your app's manifest.
zh_cn: 在构建应用程序的发布版本时，通过在 app 的 manifest 的 <application> 元素中设置 android:extractNativeLibs="false" 来打包未压缩的 .so 文件。

source: When caching is disabled, default implementation traverses all items from 0 to position.
zh_cn: 当缓存不可用时，默认的实现将从 0 到 position 遍历所有的 item。

source: When caching is enabled, it calculates from the closest cached value before the position.
zh_cn: 当缓存可用时，它从 position 之前最近的缓存的值开始计算。

source: When creating constraints, remember the following rules:
zh_cn: 创建约束时，请记住以下规则：

source: When creating new components however, never use deprecated libraries.
zh_cn: 不过，在创建新组件时，请不要再使用已弃用的库。

source: When decorating a method call parameter, this denotes that the parameter can legitimately be null and the method will gracefully deal with it.
zh_cn: 在修饰方法调用参数时，指示该参数可以合理地为 null ，该方法将优雅地处理它。

source: When decorating a method, this denotes the method might legitimately return null.
zh_cn: 在修饰一个方法时，指示该方法可以合理地返回 null 。

source: When developing an Android app, you usually use external libraries to improve your app's usability and versatility.
zh_cn: 在开发 Android 应用程序时，通常使用外部库来提高应用程序的可用性和多功能性。

source: When enabled, the framework will discard touches that are received whenever the view's window is obscured by another visible window.
zh_cn: 启用后，只要 view 的窗口被另一个可见窗口遮挡，框架就会丢弃接收到的触摸。

source: When entering (scrolling on screen) the view will scroll on any downwards scroll event, regardless of whether the scrolling view is also scrolling.
zh_cn: 当进入(滚入屏幕)时，无论滚动 view 是否也在滚动，view 都将基于任何向下的滚动事件而滚动。

source: When exiting (scrolling off screen) the view will be scrolled until it is 'collapsed'.
zh_cn: 退出(滚出屏幕)时，view 将滚动直到“折叠”。

source: When feasible, keep methods small and focused.
zh_cn: 在可行的情况下，尽量编写短小精炼的方法。

source: When in doubt, be consistent with the surrounding code.
zh_cn: 如果你有疑问，请与周围的代码保持一致。

source: When in touch mode (see notes below) views indicate whether they still would like focus via isFocusableInTouchMode() and can change this via setFocusableInTouchMode(boolean).
zh_cn: 当在触摸模式时（见下文），view 通过 isFocusableInTouchMode() 指明是否想获取焦点，并通过 setFocusableInTouchMode(boolean) 设置是否想要获取焦点。

source: When java-style was asked, the preferred styles varied wildly and it came down to Android needing to simply "pick an ordering and be consistent." So we chose a style, updated the style guide, and made the IDEs obey it.
zh_cn: 当提及 Java 样式时，开发者们喜欢的样式五花八门，最终针对 Android 简单归结为 "选择一种兼容一致的排序方式"。因此我们选择了一种样式，更新了样式指南，并让 IDE 遵循该指南。

source: When pages are not visible to the user, their entire fragment may be destroyed, only keeping the saved state of that fragment.
zh_cn: 当页面对用户不可见时，它们的整个 fragment 可能被 destroy，只保留该 fragment 的保存状态。

source: When placing this in a view hierarchy, after inflating the hierarchy you must call setup(Context, FragmentManager, int) to complete the initialization of the tab host.
zh_cn: 将此放置在 view 层次结构中时，在对层次结构进行加载后，必须调用 setup(Context, FragmentManager, int) 以完成 tab host 的初始化。

source: When possible, logging should be kept on a single line if it makes sense.
zh_cn: 在内容有意义的情况下尽可能使日志记录在一行之内。

source: When rendered in software, TextureView will draw nothing.
zh_cn: 在软件中渲染时，TextureView 不会绘制任何内容。

source: When rotating large views, it is recommended to adjust the camera distance accordingly.
zh_cn: 当旋转大 view 时，建议相应地调整相机距离。

source: When running on Android 3.0 or above, this implementation is still used; it does not try to switch to the framework's implementation.
zh_cn: 当运行在 Android 3.0 及以上时，该实现仍然可用，它不会试图切换到框架的实现。

source: When running on a higher density screen, the number of pixels used to draw 1dp is scaled up by a factor appropriate for the screen's dpi.
zh_cn: 在更高密度的屏幕上运行时，用于绘制 1dp 的像素数按照适合屏幕 dpi 的系数放大。

source: When scroll state is changed to SCROLL_STATE_IDLE, StaggeredGrid will check if there are gaps in the because of full span items.
zh_cn: 当滚动状态改变为 SCROLL_STATE_IDLE 时 StaggeredGrid 将检查是否有由于 full span item 造成间隙。

source: When set to alignMargins, causes alignment to take place between the outer boundary of a view, as defined by its margins.
zh_cn: 设置为 alignMargins 时，会导致在 view 的外边界之间进行对齐，如边距所定义。

source: When set to false, prevents the layout from aligning its children's baselines.
zh_cn: 设置为 false 时，阻止布局对齐其子项的基线。

source: When set to false, the ListView will not draw the divider after each header view.
zh_cn: 设置为 false 时，ListView 将不会在每个 header view 后绘制分隔符。

source: When set to false, the ListView will not draw the divider before each footer view.
zh_cn: 设置为 false 时，ListView 不会在每个 footer view 之前绘制分隔符。

source: When set to true, all children with a weight will be considered having the minimum size of the largest child.
zh_cn: 设置为 true 时，所有具有 weight 的子 view 将被视为具有最大 weight 的子 view 的最小尺寸。

source: When set to true, forces column boundaries to appear in the same order as column indices.
zh_cn: 设置为 true 时，强制列边界以与列索引相同的顺序显示。

source: When set to true, forces row boundaries to appear in the same order as row indices.
zh_cn: 设置为 true 时，强制行边界以与行索引相同的顺序显示。

source: When set to true, tells GridLayout to use default margins when none are specified in a view's layout parameters.
zh_cn: 设置为 true 时，告诉 GridLayout 在 view 的布局参数中未指定任何边距时使用默认边距。

source: When set to true, the list uses a drawing cache during scrolling.
zh_cn: 设置为 true 时，列表在滚动期间使用绘制缓存。

source: When set to true, the list will filter results as the user types.
zh_cn: 设置为 true 时，列表将按用户键入过滤结果。

source: When set to true, the list will use a more refined calculation method based on the pixels height of the items visible on screen.
zh_cn: 设置为 true 时，列表将根据屏幕上可见项目的像素高度使用更精确的计算方法。

source: When set to true, the selector will be drawn over the selected item.
zh_cn: 设置为 true 时，将在所选项目上绘制选择器。

source: When setting the attribute layout_constraintHorizontal_chainStyle or layout_constraintVertical_chainStyle on the first element of a chain, the behavior of the chain will change according to the specified style (default is CHAIN_SPREAD).
zh_cn: 当在链的第一个元素上设置 layout_constraintHorizontal_chainStyle 或 layout_constraintVertical_chainStyle 属性时，链的行为将会根据指定的样式(默认是 CHAIN_SPREAD)变化。

source: When several radio buttons live inside a radio group, checking one radio button unchecks all the others.
zh_cn: 当多个单选按钮位于一个单选组中时，选中一个单选按钮将取消选中所有其他按钮。

source: When specified on a parameter, the annotation indicates that the method requires a permission which depends on the value of the parameter (and typically the corresponding field passed in will be one of a set of constants which have been annotated with a @RequiresPermission annotation.)
zh_cn: 当指示于一个参数时，该注解指示该方法需要的权限取决于参数的值。(通常所传递的相应字段将是使用 @RequiresPermission 注解的一组常量。)

source: When specified on a parameter, the annotation indicates that the method requires a permission which depends on the value of the parameter.
zh_cn: 当指示于一个参数时，该注解指示该方法需要的权限取决于参数的值。

source: When system bars are hidden in immersive mode, they can be revealed temporarily with system gestures, such as swiping from the top of the screen.
zh_cn: 当系统条隐藏在沉浸式模式中时，可以使用系统手势暂时显示它们，例如从屏幕顶部滑动。
